#define _CRT_SECURE_NO_DEPRECATE
//1000000000000000000001000000000
//1111111111111111111110111111111
//1111111111111111111111111111111
//11111111
//1111111111111111111111111111111

//写一段代码，告诉我们当前的字节序是什么
//返回1，小端
//返回2，大端
//#include <stdio.h>
//int check_sys()
//{
//	int a = 1;
//	return *(char*)&a;//指针的类型被强制转换成char*//方法3
//	//指针类型的意义：
//	//1：指针类型决定了指针的解引用操作能访问几个字节，char* p访问了1个字节
//	//2：指针类型决定了指针+1或者-1的时候，到底加的或者减的是几个字节，char* p;p+1;跳过一个字节，int* p;p+1;跳过一个整型，四个字节
//
//	//char* p = (char*)&a;
//	//return *p;//改进，返回1，小端；返回0，大端//方法2
//
//	//if (*p == 1)
//	//{
//	//	return 1;
//	//}
//	//else
//	//	return 0;//方法1
//}
//int main()
//{
//	int ret = check_sys();
//	if (ret == 1)
//	{
//		printf("小端\n");
//	}
//	else
//	{
//		printf("大端\n");
//	}
//	return 0;
//}

////写一段代码，告诉我们当前的字节序是什么
//#include <stdio.h>
//int main()
//{
//	int a = 1;
//	char* p = (char*)&a;//不强制类型转换的话，系统会报错，类型不兼容
//	if (*p == 1)//0x01就是1
//	{
//		printf("小端\n");
//	}
//	else
//	{
//		printf("大端\n");
//	}
//	return 0;
//}

//#include <stdio.h>
//int main()
//{
//	1 - 1;
//	1 + (-1);
//	//00000000000000000000000000000001 1的原码
//	//00000000000000000000000000000001 1的反码
//	//00000000000000000000000000000001 1的补码
//	//10000000000000000000000000000001 -1的原码
//	//11111111111111111111111111111110 -1的反码
//	//11111111111111111111111111111111 -1的补码
//	//00000000000000000000000000000000 1+（-1）
//	return 0;
//}

//#include <stdio.h>
//int main()
//{
//	int a = 20;//4个字节
//	int b = -10;//也是4个字节
//	return 0;
//}